TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_dbell.h
// Field:     [6] TX_CTRL
//
// Interrupt enable for RFCPEIFG.TX_CTRL.
#define RFC_DBELL_RFCPEIEN_TX_CTRL                                  0x00000040
#define RFC_DBELL_RFCPEIEN_TX_CTRL_BITN                                      6
#define RFC_DBELL_RFCPEIEN_TX_CTRL_M                                0x00000040
#define RFC_DBELL_RFCPEIEN_TX_CTRL_S                                         6

// Field:     [5] TX_ACK
//
// Interrupt enable for RFCPEIFG.TX_ACK.
#define RFC_DBELL_RFCPEIEN_TX_ACK                                   0x00000020
#define RFC_DBELL_RFCPEIEN_TX_ACK_BITN                                       5
#define RFC_DBELL_RFCPEIEN_TX_ACK_M                                 0x00000020
#define RFC_DBELL_RFCPEIEN_TX_ACK_S                                          5

// Field:     [4] TX_DONE
//
// Interrupt enable for RFCPEIFG.TX_DONE.
#define RFC_DBELL_RFCPEIEN_TX_DONE                                  0x00000010
#define RFC_DBELL_RFCPEIEN_TX_DONE_BITN                                      4
#define RFC_DBELL_RFCPEIEN_TX_DONE_M                                0x00000010
#define RFC_DBELL_RFCPEIEN_TX_DONE_S                                         4

// Field:     [3] LAST_FG_COMMAND_DONE
//
// Interrupt enable for RFCPEIFG.LAST_FG_COMMAND_DONE.
#define RFC_DBELL_RFCPEIEN_LAST_FG_COMMAND_DONE                     0x00000008
#define RFC_DBELL_RFCPEIEN_LAST_FG_COMMAND_DONE_BITN                         3
#define RFC_DBELL_RFCPEIEN_LAST_FG_COMMAND_DONE_M                   0x00000008
#define RFC_DBELL_RFCPEIEN_LAST_FG_COMMAND_DONE_S                            3

// Field:     [2] FG_COMMAND_DONE
//
// Interrupt enable for RFCPEIFG.FG_COMMAND_DONE.
#define RFC_DBELL_RFCPEIEN_FG_COMMAND_DONE                          0x00000004
#define RFC_DBELL_RFCPEIEN_FG_COMMAND_DONE_BITN                              2
#define RFC_DBELL_RFCPEIEN_FG_COMMAND_DONE_M                        0x00000004
#define RFC_DBELL_RFCPEIEN_FG_COMMAND_DONE_S                                 2

// Field:     [1] LAST_COMMAND_DONE
//
// Interrupt enable for RFCPEIFG.LAST_COMMAND_DONE.
#define RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE                        0x00000002
#define RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE_BITN                            1
#define RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE_M                      0x00000002
#define RFC_DBELL_RFCPEIEN_LAST_COMMAND_DONE_S                               1

// Field:     [0] COMMAND_DONE
//
// Interrupt enable for RFCPEIFG.COMMAND_DONE.
#define RFC_DBELL_RFCPEIEN_COMMAND_DONE                             0x00000001
#define RFC_DBELL_RFCPEIEN_COMMAND_DONE_BITN                                 0
#define RFC_DBELL_RFCPEIEN_COMMAND_DONE_M                           0x00000001
#define RFC_DBELL_RFCPEIEN_COMMAND_DONE_S                                    0

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFCPEISL
//
//*****************************************************************************
// Field:    [31] INTERNAL_ERROR
//
// Select which CPU interrupt vector the RFCPEIFG.INTERNAL_ERROR interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR                           0x80000000
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR_BITN                              31
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR_M                         0x80000000
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR_S                                 31
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR_CPE1                      0x80000000
#define RFC_DBELL_RFCPEISL_INTERNAL_ERROR_CPE0                      0x00000000

// Field:    [30] BOOT_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.BOOT_DONE interrupt should
// use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_BOOT_DONE                                0x40000000
#define RFC_DBELL_RFCPEISL_BOOT_DONE_BITN                                   30
#define RFC_DBELL_RFCPEISL_BOOT_DONE_M                              0x40000000
#define RFC_DBELL_RFCPEISL_BOOT_DONE_S                                      30
#define RFC_DBELL_RFCPEISL_BOOT_DONE_CPE1                           0x40000000
#define RFC_DBELL_RFCPEISL_BOOT_DONE_CPE0                           0x00000000

// Field:    [29] MODULES_UNLOCKED
//
// Select which CPU interrupt vector the RFCPEIFG.MODULES_UNLOCKED interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED                         0x20000000
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED_BITN                            29
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED_M                       0x20000000
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED_S                               29
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED_CPE1                    0x20000000
#define RFC_DBELL_RFCPEISL_MODULES_UNLOCKED_CPE0                    0x00000000

// Field:    [28] SYNTH_NO_LOCK
//
// Select which CPU interrupt vector the RFCPEIFG.SYNTH_NO_LOCK interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK                            0x10000000
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK_BITN                               28
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK_M                          0x10000000
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK_S                                  28
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK_CPE1                       0x10000000
#define RFC_DBELL_RFCPEISL_SYNTH_NO_LOCK_CPE0                       0x00000000

// Field:    [27] IRQ27
//
// Select which CPU interrupt vector the RFCPEIFG.IRQ27 interrupt should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_IRQ27                                    0x08000000
#define RFC_DBELL_RFCPEISL_IRQ27_BITN                                       27
#define RFC_DBELL_RFCPEISL_IRQ27_M                                  0x08000000
#define RFC_DBELL_RFCPEISL_IRQ27_S                                          27
#define RFC_DBELL_RFCPEISL_IRQ27_CPE1                               0x08000000
#define RFC_DBELL_RFCPEISL_IRQ27_CPE0                               0x00000000

// Field:    [26] RX_ABORTED
//
// Select which CPU interrupt vector the RFCPEIFG.RX_ABORTED interrupt should
// use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_RX_ABORTED                               0x04000000
#define RFC_DBELL_RFCPEISL_RX_ABORTED_BITN                                  26
#define RFC_DBELL_RFCPEISL_RX_ABORTED_M                             0x04000000
#define RFC_DBELL_RFCPEISL_RX_ABORTED_S                                     26
#define RFC_DBELL_RFCPEISL_RX_ABORTED_CPE1                          0x04000000
#define RFC_DBELL_RFCPEISL_RX_ABORTED_CPE0                          0x00000000

// Field:    [25] RX_N_DATA_WRITTEN
//
// Select which CPU interrupt vector the RFCPEIFG.RX_N_DATA_WRITTEN interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN                        0x02000000
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN_BITN                           25
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN_M                      0x02000000
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN_S                              25
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN_CPE1                   0x02000000
#define RFC_DBELL_RFCPEISL_RX_N_DATA_WRITTEN_CPE0                   0x00000000

// Field:    [24] RX_DATA_WRITTEN
//
// Select which CPU interrupt vector the RFCPEIFG.RX_DATA_WRITTEN interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN                          0x01000000
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN_BITN                             24
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN_M                        0x01000000
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN_S                                24
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN_CPE1                     0x01000000
#define RFC_DBELL_RFCPEISL_RX_DATA_WRITTEN_CPE0                     0x00000000

// Field:    [23] RX_ENTRY_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.RX_ENTRY_DONE interrupt
// should use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE                            0x00800000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_BITN                               23
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_M                          0x00800000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_S                                  23
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_CPE1                       0x00800000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_CPE0                       0x00000000

// Field:    [22] RX_BUF_FULL
//
// Select which CPU interrupt vector the RFCPEIFG.RX_BUF_FULL interrupt should
// use.
// ENUMs:
// CPE1                     Associate this interrupt line with INT_RF_CPE1
//                          interrupt vector
// CPE0                     Associate this interrupt line with INT_RF_CPE0
//                          interrupt vector
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL                              0x00400000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_BITN                                 22
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_M                            0x00400000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_S                                    22
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_CPE1                         0x00400000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_CPE0                         0x00000000

